<!DOCTYPE html>
<html lang="pt-br">
<head>
  <meta charset="UTF-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <meta property="og:title" content="Simulador PID">
  <meta property="og:description" content="Din&acirc;mico - Online">
  <meta name="classification" content="simulador din&acirc;mico online controle PID">
  <meta name="keywords" content="online,controle PID,din&acirc;mico,simulador">
  <meta name="author" content="Renato Markele Ferreira C&acirc;ndido e Claudio Cesar Bezerra Teles">

  <title>Simulador Did&aacute;tico Din&acirc;mico Sistema Controle Malha Fechada PID</title><meta name="description" content="Din&acirc;mico - Online">
  
  <link rel="stylesheet" href="../../assets/styles/help.css">
</head>
<body class="help-body">
  
  <main class="know-more">
    <div class="title">
      <h2>SIMULADOR DID&Aacute;TICO DE CONTROLE EM MALHA FECHADA<br>Mk-2 v.2024.02</h2> 
      <h2>Sistema Massa-Mola-Amortecedor</h2>
      <h3>Renato Markele Ferreira C&acirc;ndido / Claudio Cesar Bezerra Teles</h3>
      <p>--- USO GRATUITO ---</p>
    </div> 

    <hr />
    <div class="notes">
      

      <p>
        &#128712; Esse simulador pode ser acessado em  <a href="https://proanuncio.com.br/sc2" target="_blank">https://proanuncio.com.br/sc2</a> 
      </p>

      <p>
        &#128712; Para acessar o simulador Mk-1 <a href="https://proanuncio.com.br/sc" target="_blank">clique aqui</a>.
      </p>

      <p>
        &#128712; As grandezas simuladas s&atilde;o expressas em unidades do Sistema
      Internacional (SI).
      </p>

      <p> &#128712; Nos valores num&eacute;ricos emprega-se o ponto decimal em vez de v&iacute;rgula.</p>

    </div>
    <hr />


    <p>
    O processo controlado &eacute; um sistema de segunda ordem do tipo
    massa-mola-amortecedor sem atrito com o ar. O(A) utilizador(a)
    pode inserir os par&acirc;metros do
    processo, ou seja, massa m, coeficiente de amortecimento c e constante
    da mola Ks. Os valores de c e Ks podem ser negativos. Embora a anima&ccedil;&atilde;o
    mostre um carro dotado de rodas, a simula&ccedil;&atilde;o assume que a massa flutua
    sobre o solo.
    </p>

    <p>
    A vari&aacute;vel de processo (controlada) PV(t) &eacute; a posi&ccedil;&atilde;o do eixo vertical
    da massa, que é medida em metros por um indicador de posi&ccedil;&atilde;o oculto. A faixa
    de indica&ccedil;&atilde;o vai de PVmin a PVmax. O(A) utilizador(a) pode alterar esses
    limites (em metros) e inserir um valor de erro (em metros) na posição indicada. O 
    processo &eacute; sujeito &agrave; for&ccedil;a perturbadora Fp(t).
    A vari&aacute;vel manipulada &eacute; a for&ccedil;a de controle
    Fc(t) que o elemento final de controle (motor linear) exerce no
    processo. O modelo da
    simula&ccedil;&atilde;o presume que todas as for&ccedil;as est&atilde;o contidas no eixo horizontal
    da massa.
    </p>

    <p>O controlador tem as seguintes caracter&iacute;sticas:</p>
    <ul>
      <li>Recebe o <span style="font-style: italic;">setpoint</span> SP(t) e a vari&aacute;vel controlada PV(t);</li>
      <li>Calcula o erro e(t) = SP(t) - PV(t);</li>
      <li>Fornece a sa&iacute;da (<span style="font-style: italic;">output</span>) OP(t);</li>
      <li>Permite que o(a) utilizador(a):</li>
      <ul>
        <li>
          Selecione o modo de controle (PID, PID <span style="font-style: italic;">Anti-windup</span> ou Biest&aacute;vel);
        </li>
        <li>
          Ajuste diretamente a for&ccedil;a de controle Fc(t) quando no modo MANUAL;
          e
        </li>
        <li>Selecione A&ccedil;&atilde;o Direta (DIR) ou A&ccedil;&atilde;o Reversa.</li>
      </ul>
    </ul>


    <p>
    O diagrama abaixo mostra a intera&ccedil;&atilde;o entre processo, controle
    e ambiente simulados.
    </p>

    <div class="help-img">
      <img alt="" src="../../assets/images/esquema_pt.jpeg">
    </div>

    <p>
    A estrutura PID b&aacute;sica empregada pelo simulador &eacute; definida por meio da seguinte
    equa&ccedil;&atilde;o:
    <br>
    <br>
    OP(t) = Kp &middot;e(t) + Ki &middot; <span>&int; </span>e(t)dt + Kd
    &middot; ė(t) + OPo. <br>
    <br>
    Sendo Ki = Kp/Ti e Kd = KpTd.
    </p>

    <p>
    Ganhos Kp, Ki e Kd, sa&iacute;da OP(t) e pr&eacute;-carga OPo s&atilde;o
    adimensionais. SP(t), PV(t), e(t) e banda proporcional BP (= 1/Kp)
    tamb&eacute;m s&atilde;o adimensionais mas s&atilde;o expressos em metros por conveni&ecirc;ncia.
    O(A) utilizador(a) pode inserir Kp, Ki, Kd, OPo e SP(t) e observar
    as demais vari&aacute;veis. OP(t) pode variar entre -100% e 100%.
    </p>

    <p>
    O desenho abaixo mostra as equa&ccedil;&otilde;es b&aacute;sicas do
    simulador. M(t) representa a curva de resposta do motor linear.
    Fcmax &eacute; a m&aacute;xima magnitude que a for&ccedil;a de controle
    Fc(t) pode alcan&ccedil;ar. </p>

    <div class="help-img">
    <img alt="" src="../../assets/images/equacoes2.jpeg">
    </div>

    <p>
    Essa vers&atilde;o disponibiliza quatro modos de controle em malha fechada:
    </p>
    <ul>
      <li>Modo PID;</li>
      <li>Modo <span style="font-style: italic;">Anti-windup</span> PD + I se |e| &lt; eLim;</li>
      <li>Modo <span style="font-style: italic;">Anti-windup</span> PD + I se |D| &lt; DLim; e</li>
      <li>Modo Biest&aacute;vel.</li>
    </ul>

    <p>Ao selecionar o modo "PID" o(a) utilizador(a) poder&aacute;:</p>
    <ul>
      <li>
      Ajustar Imax para limitar a magnitude da componente integral a um
      valor inferior a 100%;
      </li>
      <li>
      Fazer a derivada ser calculada sobre a PV(t) em vez de sobre o erro
      e(t);
      </li>
      <li>
      Ajustar a frequ&ecirc;ncia de corte (em Hz) do filtro passa-baixa existente
      na sa&iacute;da do c&aacute;lculo da componente derivativa; e
      </li>
      <li>Contornar o filtro passa-baixa.</li>
    </ul>

    <p>
    Ao escolher o modo "PD + I se |e| &lt; eLim" o(a)
    utilizador(a) pode alterar a magnitude do limiar de erro eLim (em
    metros) que aciona o integrador.
    </p>

    <p>
    Ao escolher o modo "PD + I se |D| &lt; DLim" o(a)
    utilizador(a) pode entrar com o valor do m&oacute;dulo do limiar de
    derivada DLim (em %) que liga o integrador.
    </p>

    <p>
    Ao selecionar o modo "Biest&aacute;vel" o(a) utilizador(a) pode inserir o
    valor da banda morta (em metros) e os valores m&iacute;nimo e m&aacute;ximo
    de OP(t).
    </p>

    <p>
    O(A) utilizador(a) pode ligar ou desligar as seguintes exibi&ccedil;&otilde;es na tela:
    </p>
    <ul>
      <li>Anima&ccedil;&atilde;o;</li>
      <li>Limites do envelope de opera&ccedil;&atilde;o - linhas s&oacute;lidas/tracejadas em vermelho;</li>
      <li>PV(t) - linha tracejada em verde-azulado escuro;</li>
      <li>Faixa de indica&ccedil;&atilde;o da PV(t) - em laranja;</li>
      <li>SP(t) - linha tracejada em azul; e</li>
      <li>Banda Proporcional BP - em verde.</li>
    </ul>
    As tr&ecirc;s &uacute;ltimas indica&ccedil;&otilde;es, bem como o cursor deslizante de ajuste manual do SP, 
    somente aparecem quando o controlador est&aacute; ligado. Ao ativar a exibi&ccedil;&atilde;o do envelope 
    de opera&ccedil;&atilde;o, o usu&aacute;rio &eacute; habilitado a alterar os limites do envelope.

    <p>
    O motor linear recebe o comando OP(t) e o converte na for&ccedil;a controladora 
    Fc(t) de acordo com a curva M(t) de resposta do motor, que pode ser
    ideal ou n&atilde;o-ideal. O valor de Fc(t) &eacute; limitado a variar
    entre -Fcmax e Fcmax. O(A) utilizador(a)
    pode inserir o valor de Fcmax (em newtons) e selecionar o tipo de curva
    do motor. Se escolher curva n&atilde;o-ideal, o(a) utilizador(a) pode
    inserir a inclina&ccedil;&atilde;o central da curva (sigm&oacute;ide) e
    respectiva folga (em %). O(A) utilizador(a)
    pode inserir o tempo morto do motor (em ms) e selecionar
    A&ccedil;&atilde;o Direta (DIR) ou A&ccedil;&atilde;o Reversa.
    </p>

    <p>
    Quando o controlador encontra-se ligado, o simulador ativa um display que
    mostra as componentes de OP e outro display que mostra Fc(t).
    Por meio da curva de Fc(t) o(a) utilizador(a) pode ver o
    formato da resposta M(t) do motor.
    </p>


    <p>
    O <span style="font-style: italic;">setpoint</span> SP(t) pode ser constante ou vari&aacute;vel. H&aacute; diversos tipos de
    SP(t) dispon&iacute;veis. O(A) utilizador(a) pode selecionar uma op&ccedil;&atilde;o e
    ajustar os limites SPmin e SPmax (em metros).
    </p>

    <p>
    A perturba&ccedil;&atilde;o Fp(t) pode ser constante ou vari&aacute;vel. H&aacute; diversas
    alternativas de Fp(t) dispon&iacute;veis. O(A) utilizador(a) pode escolher um
    tipo e inserir os limites Fpmin e Fpmax, que s&atilde;o expressos em
    percentuais de Fcmax.
    </p>

    <p>Por interm&eacute;dio do menu situado no canto superior direito da
    tela o(a) utilizador(a) pode escolher um cen&aacute;rio predefinido. O(a) utilizador(a) pode
    tamb&eacute;m alterar os par&acirc;metros do cen&aacute;rio selecionado.
    </p>

    <p>
    Quanto mais a <span style="font-style: italic;">frame rate</span> m&eacute;dia
    (em <span style="font-style: italic;">FPS</span>) do computador do(a)
    utilizador(a) se aproximar da esperada, mais a simula&ccedil;&atilde;o se aproximar&aacute;
    de tempo real (ver indicadores exibidos no canto inferior esquerdo da
    tela).
    </p>

    <p>
    Coment&aacute;rios podem ser encaminhados aos seguintes endere&ccedil;os:
    claudioteles12@gmail.com e renatomarkele@hotmail.com. Por favor escreva
    SIMULADOR no assunto de sua mensagem para permitir distin&ccedil;&atilde;o
    de <span style="font-style: italic;">spam</span>.
    </p>

    <p>Gratos!</p>
  </main>
</body></html>